In [3]:
import numpy as np 
import pandas as pd

Merge

In [ ]:
# Employee Data
employees = pd.DataFrame({
    "Employee_id":[1,2,3,4,5],
    "Name":['John','Anna','Peter','Linda','Bob'],
    "Department":['HR','IT','Finance','IT','HR']
})

# Salaries Data
salaries = pd.DataFrame({
    "Employee_id":[1,2,3,6,7],
    "Salary":[60000,80000,65000,70000,90000],
    "Bonus":[5000,10000,7000,8000,12000]
})

In [6]:
employees

   Employee_id   Name Department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [8]:
salaries

   Employee_id  Salary  Bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [9]:
pd.merge(employees,salaries)

   Employee_id   Name Department  Salary  Bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [14]:
pd.merge(employees,salaries,on="Employee_id",how="inner")

   Employee_id   Name Department  Salary  Bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [21]:
pd.merge(employees,salaries,on="Employee_id",how="outer")

   Employee_id   Name Department   Salary    Bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [ ]:
pd.merge(employees,salaries,on="Employee_id",how="left")

   Employee_id   Name Department   Salary    Bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [24]:
pd.merge(employees,salaries,on="Employee_id",how="right")

   Employee_id   Name Department  Salary  Bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

Concatination

In [25]:
df1 = pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2']
})
df2 =pd.DataFrame({
    'A':['A3','A4','A5'],
    'B':['B3','B4','B5'],
    'C':['C3','C4','C5']
})

In [27]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [28]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [29]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [ ]:
pd.concat([df2,df1])

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [33]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

Joining

In [34]:
df1 = pd.DataFrame({
    "Name":['Alice','Bob','Charlie']
},index=[1,2,3])
df2 = pd.DataFrame({
    "Score":[85,90,75]
},index =[2,3,4])

In [37]:
df1

      Name
1    Alice
2      Bob
3  Charlie

In [38]:
df2

   Score
2     85
3     90
4     75

In [39]:
df1.join(df2)

      Name  Score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

In [40]:
df2.join(df1)

   Score     Name
2     85      Bob
3     90  Charlie
4     75      NaN

In [41]:
df1.join(df2,how='outer')

      Name  Score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0